eclipse-threadx/getting-started/SiliconLabs/EFR32MG12/lib/gecko_sdk_3.0.0_efr32mg12/platform/emlib/src/em_usart.c
/***************************************************************************//**
 * @file
 * @brief Universal synchronous/asynchronous receiver/transmitter (USART/UART)
 *   Peripheral API
 *******************************************************************************
 * # License
 * <b>Copyright 2018 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

#include "em_usart.h"
#if defined(USART_COUNT) && (USART_COUNT > 0)

#include "em_cmu.h"
#include "em_bus.h"
#include "em_assert.h"
#if defined(USART_CTRLX_CTSEN)
#include "em_gpio.h"
#endif

/*******************************************************************************
 *******************************   DEFINES   ***********************************
 ******************************************************************************/

/** @cond DO_NOT_INCLUDE_WITH_DOXYGEN */

/** Validation of USART register block pointer reference for assert statements. */
#if (USART_COUNT == 1) && defined(USART0)
#define USART_REF_VALID(ref)    ((ref) == USART0)

#elif (USART_COUNT == 1) && defined(USART1)
#define USART_REF_VALID(ref)    ((ref) == USART1)

#elif (USART_COUNT == 2) && defined(USART2)
#define USART_REF_VALID(ref)    (((ref) == USART1) || ((ref) == USART2))

#elif (USART_COUNT == 2)
#define USART_REF_VALID(ref)    (((ref) == USART0) || ((ref) == USART1))

#elif (USART_COUNT == 3)
#define USART_REF_VALID(ref)    (((ref) == USART0) || ((ref) == USART1) \
                                 || ((ref) == USART2))
#elif (USART_COUNT == 4)
#define USART_REF_VALID(ref)    (((ref) == USART0) || ((ref) == USART1) \
                                 || ((ref) == USART2) || ((ref) == USART3))
#elif (USART_COUNT == 5)
#define USART_REF_VALID(ref)    (((ref) == USART0) || ((ref) == USART1)    \
                                 || ((ref) == USART2) || ((ref) == USART3) \
                                 || ((ref) == USART4))
#elif (USART_COUNT == 6)
#define USART_REF_VALID(ref)    (((ref) == USART0) || ((ref) == USART1)    \
                                 || ((ref) == USART2) || ((ref) == USART3) \
                                 || ((ref) == USART4) || ((ref) == USART5))
#else
#error "Undefined number of USARTs."
#endif

#if defined(USARTRF_COUNT) && (USARTRF_COUNT > 0)
  #if (USARTRF_COUNT == 1) && defined(USARTRF0)
    #define USARTRF_REF_VALID(ref)  ((ref) == USARTRF0)
  #elif (USARTRF_COUNT == 1) && defined(USARTRF1)
    #define USARTRF_REF_VALID(ref)  ((ref) == USARTRF1)
  #else
    #define USARTRF_REF_VALID(ref)  (0)
  #endif
#else
  #define USARTRF_REF_VALID(ref)  (0)
#endif

#if (_SILICON_LABS_32B_SERIES == 2)
  #define USART_IRDA_VALID(ref)      USART_REF_VALID(ref)
#elif defined(_SILICON_LABS_32B_SERIES_1)
  #if defined(_SILICON_LABS_GECKO_INTERNAL_SDID_100) || defined(_SILICON_LABS_GECKO_INTERNAL_SDID_103)
// If GG11 or TG11
    #define USART_IRDA_VALID(ref)    (((ref) == USART0) || ((ref) == USART2))
  #elif defined(USART3)
    #define USART_IRDA_VALID(ref)    (((ref) == USART0) || ((ref) == USART1) || ((ref) == USART2) || ((ref) == USART3))
  #elif defined(USART2)
    #define USART_IRDA_VALID(ref)    (((ref) == USART0) || ((ref) == USART1) || ((ref) == USART2))
  #else
    #define USART_IRDA_VALID(ref)    (((ref) == USART0) || ((ref) == USART1))
  #endif
#elif defined(_SILICON_LABS_32B_SERIES_0)
  #if defined(_EZR32_HAPPY_FAMILY)
    #define USART_IRDA_VALID(ref)    ((ref) == USART0)
  #elif defined(_EFM32_HAPPY_FAMILY)
    #define USART_IRDA_VALID(ref)    (((ref) == USART0) || ((ref) == USART1))
  #elif defined(USART0)
    #define USART_IRDA_VALID(ref)    ((ref) == USART0)
  #elif (USART_COUNT == 1) && defined(USART1)
    #define USART_IRDA_VALID(ref)    ((ref) == USART1)
  #elif defined(USARTRF0)
    #define USART_IRDA_VALID(ref)    ((ref) == USARTRF0)
  #else
    #define USART_IRDA_VALID(ref)    (0)
  #endif
#endif

#if (_SILICON_LABS_32B_SERIES == 2)
  #define USART_I2S_VALID(ref)      USART_REF_VALID(ref)
#elif defined(_SILICON_LABS_32B_SERIES_1)
  #if defined(USART4)
    #define USART_I2S_VALID(ref)    (((ref) == USART1) || ((ref) == USART3) || ((ref) == USART4))
  #elif defined(USART3)
    #define USART_I2S_VALID(ref)    (((ref) == USART1) || ((ref) == USART3))
  #else
    #define USART_I2S_VALID(ref)    ((ref) == USART1)
  #endif
#elif defined(_SILICON_LABS_32B_SERIES_0)
  #if defined(_EZR32_HAPPY_FAMILY)
    #define USART_I2S_VALID(ref)    ((ref) == USART0)
  #elif defined(_EFM32_HAPPY_FAMILY)
    #define USART_I2S_VALID(ref)    (((ref) == USART0) || ((ref) == USART1))
  #elif defined(_EFM32_TINY_FAMILY) || defined(_EFM32_ZERO_FAMILY)
    #define USART_I2S_VALID(ref)    ((ref) == USART1)
  #elif defined(_EFM32_GIANT_FAMILY) || defined(_EFM32_WONDER_FAMILY)
    #define USART_I2S_VALID(ref)    (((ref) == USART1) || ((ref) == USART2))
  #endif
#endif

#if (UART_COUNT == 1) && !defined(_UART_IPVERSION_MASK)
  #define UART_REF_VALID(ref)    ((ref) == UART0)
#elif (UART_COUNT == 2) && !defined(_UART_IPVERSION_MASK)
  #define UART_REF_VALID(ref)    (((ref) == UART0) || ((ref) == UART1))
#else
  #define UART_REF_VALID(ref)    (0)
#endif

